{
  "title": "“Goodnight gorgeous”",
  "author": "420Eski-Grim",
  "score": 90,
  "upvote_ratio": 1.0,
  "created_utc": 1751984452.0,
  "created_date": "2025-07-08 19:50:52",
  "url": "https://reddit.com/r/scarystories/comments/1luptoo/goodnight_gorgeous/",
  "text": "“Goodnight gorgeous”.\n\nMy partner strained, reaching over to give me the familiar goodnight peck. Startled, I rise, aiming to meet her midnight kiss in the dark of the night. The only light emanating from the low-glow of the laptop, undoubtedly playing one of the trilogies of a popular known movie series featuring walking trees and burning rings.\n\n\n“Shit” / “Ouch” – A mutual exclamation as we unassumingly bumped the tips of our noses in the unforgiving darkness.\n\n\nI saw her mouthing something at me, but her voice was immediately distant. Having woken suddenly from my slumber, eagerly receptive of the end-of-day affection, I’d seemingly disorientated myself.\n \n\nI vaguely mumbled something back, confused, scared…why couldn’t I hear anything?\n\nShe mouthed something incoherent at me again. I clutched the sheets.\n\nMy sweaty palms relived from the cotton.\n\n\n\n“BABE!” She mouthed. What was probably only a couple of seconds felt like a blurry minute as tried to make sense of what was happening in my daze and half-conscious state.\n\nShe sat up and lent in to wards me. Her eyes seemed to bulge from the glow of the screen.\n\nWas she leaning in for another kiss? I could see a frown. She loomed over me, her shadow engulfing what now seemed like the only solace in the room.\n\nHer hands decended upon my face. Reaching down, she sunk her fingers into my neck. Fumbling around my jugular.\n\n“What are you doing?!” I tried to vocalise – but my voice still seemed separate from my body. As though I was hearing myself under water.\n\n \n\nI could feel my heart beating in my chest.\n\n \n\nHer fingers found my ears. They starting scathing the outer ear. And then suddenly, she pushed her fingers into my ears.\n\nOh my God, I’m about to go deaf and I can’t even remember what the last thing I heard was!\n\nI tried to reach for her arms, a feeble attempt to stop what was already in motion.\n\nJust as I was about to cry out for the last time, the silence became deafening.\n\nAnd then became loud.\n\nAnd then quiet again…\n\n….\n\n\nMy girlfriend stared at me, motionless, but still conveying enough emotion for me to see the flicker of anger and annoyance in her eye.\n\n“You fucking idiot”.\n\nI stared back blankly. Basking in the brief miracle of regaining hearing. Waiting for the onslaught.\n\n\nAn eternity seemed to pass whilst my brain scrambled, trying to reconcile what was happening.\n\n…..\n\n\n“You’ve had your earplugs in this whole-time you weirdo!”",
  "num_comments": 1,
  "awards": 0,
  "id": "1luptoo",
  "word_count": 420
}