{
  "title": "I Think My Wife Changed the Lock While I Was at Work",
  "author": "JacksonLuna",
  "score": 134,
  "upvote_ratio": 0.99,
  "created_utc": 1752191708.0,
  "created_date": "2025-07-11 05:25:08",
  "url": "https://reddit.com/r/scarystories/comments/1lws80u/i_think_my_wife_changed_the_lock_while_i_was_at/",
  "text": "The key won’t turn.\n\nI jiggle it again, the familiar brass cool against my fingers. Click-click. Nothing. Just resistance, where there should be the easy slide of the deadbolt. I’ve used this key a thousand times, and right now–groceries in one arm, briefcase tucked tight, half-asleep after a long day at work–I am not amused.\n\n“Emily?” I call, giving the solid oak door a knock. “Hey, the lock’s being weird. Did you deadbolt it funny again?”\n\nSilence from within.\n\nI peer through the narrow, leaded-glass window beside the door. Emily is standing in the hall, frozen halfway between the living room and the kitchen. She isn’t moving toward the door. She’s staring at me. \n\nHer face is bone-white, her eyes wide and unblinking, fixed on mine through the distorted glass. She looks like she’s seen a ghost.\n\n“Emily? What’s wrong?”\n\nI knock harder, a flicker of unease tightening in my chest.\n\n“Emily, hey, are you okay? Let me in, please. It’s me, it’s Ben.” I rattle the handle, panic rising now, all my focus on her.\n\nA choked sob escapes her, her hand flying to her mouth. Tears well and spill over, tracking paths through her pallor. Still, she doesn’t move toward the lock.\n\n“Emily, please!” I hammer on the wood now. “Open the door! Talk to me! What happened?”\n\nShe flinches like she’s been struck, stumbling back a step.\n\n“No,” she whispers, shaking her head. “No, no. This isn’t… this isn’t possible.”\n\nMy heart kicks hard. “Emily? Honey, what’s going on?” I press my face closer to the door, voice low, urgent. “Open the door. Please. Let me help you.”\n\nShe backs further into the shadows, her hands trembling at her sides. “No,” she says again, firmer this time. “You can’t be here.”\n\n“Emily,” I say softly. “It’s me. It’s Ben. Just–just open the door, please.”\n\nShe snaps then, her voice sharp and panicked. “You’re not Ben! Ben is dead!”\n\nSilence slams between us.\n\nHer voice, when it returns, is a thin, broken whisper, barely audible through the thick wood. “You… you died, Ben. Six months ago.”\n\nAnother sob tears through her. “We mourned you. I mourned you.”\n\nSix months. The impossibility of it slams into me. I remember yesterday morning—kissing her sleep-warm cheek, the smell of her shampoo, the mundane argument about whose turn it was to take out the recycling. I remember today—the commute, the tedious budget meeting.\n\n“Emily, that’s insane! I’m right here! Look at me! I saw you this morning! I’m real!”\n\n“You look like him,” she weeps, her voice thick with revulsion now, cutting through the fear. “You sound… almost like him. But you’re not Ben.” Her terror isn’t hysterical; it’s cold, absolute, and utterly devastating. “Please… just… go away. Whatever you are… leave us alone. Please.”\n\nAnd then she turns. Her footsteps echo down the hall, leaving me stranded, exiled, on the porch of my own home.\n\nMy breath stutters. My fingers go numb. I drop the groceries without realizing; plastic bags splitting, cans rolling across the stoop. I dig in my pocket for my phone, hands trembling, but it isn’t there. Of course it isn’t there. Where the hell is it?\n\n“Help!” I shout, turning to the street. “Somebody, please! I need help!”\n\nWindows glow warmly in the distance. Cars pass. No one answers.\n\nI sprint down the sidewalk, nearly tripping on the curb, and tear across the block toward Mike’s house. My oldest friend. The only person who might make sense of this.\n\nThe porch light is off. \n\nI pound on the door with both fists. “Mike! Mike, open up! It’s Ben! Emily’s not okay, she's saying crazy things! Please, man, I don’t know what’s going on!”\n\nThe living room curtain twitches. A sliver of Mike’s face appears, pale, strained, eyes wide and bloodshot.\n\nThe porch light flicks on.\n\nThe door cracks open, and there’s Mike, standing barefoot in the doorway, blinking against the glare.\n\nI open my mouth to tell him all that happened, but the look on his face stops me cold. It isn’t confusion. It isn’t disbelief. It’s pure, unadulterated horror, the same look Emily wore.\n\nHe sees me. His lips press into a thin, bloodless line, and the door snaps shut.\n\n“Mike! Don’t do this!” I roar, slamming my fist against the wood. “IT’S ME!”\n\nHis voice—shrill with panic—comes from an upstairs window. “STAY AWAY! I’M CALLING THEM! I’M CALLING THE POLICE! GET OFF MY PROPERTY!” \n\nThe window slams shut.\n\nThat’s when I hear the sirens—faint at first, then rising into a full, shrieking wail that floods the street. Red and blue lights strobe across the trees, the houses, my face. Two cruisers skid to a stop, blocking my car. The officers step out, hands hovering near their holsters, every movement cautious and controlled.\n\n“Sir! Step away from the door! Hands where I can see them!” the female officer shouts.\n\nRelief crashes again into panic. \n\n“Officers! Thank God! My wife, Emily—our house is right here—she locked me out! Changed the locks! She’s having a breakdown! And Mike here” I gesture wildly at the house, “he won’t listen! Something’s terribly wrong! Please help her, she’s alone and terrified!”\n\nThe male officer, younger, keeps his laser focus on me. “Sir, your name? Calmly.”\n\n“Ben Carter! I live right here! Please, you have to help me get to my wife! She needs me!”\n\nThe female officer’s eyes flick to Mike’s house. The upstairs window is open a crack. Mike’s face is visible. He nods frantically, pointing at me, his mouth moving silently. *Him. That’s him.*\n\n“Mr. Carter,” the female officer says, her voice losing none of its edge, “you need to calm down. You’re causing a disturbance. You’re trespassing and causing distress.”\n\n“Trespassing? He’s my best friend! My wife needs help! Check your files! Call it in! I’m *BEN CARTER!*” My voice is raw, rising uncontrollably. The frustration, the fear, the sheer impossibility of it all boils over. I take an involuntary step toward her, hands gesturing wildly. \n\n“Sir, step back!” both officers shout in unison. The male officer draws his taser—not aiming, but holding it ready. “Hands behind your back. Now.”\n\n“No! Listen to me!” I yell, the world narrowing to the flashing lights, their rigid faces, Mike’s terrified eyes in the window. I don’t resist, but my body is taut wire, vibrating with frantic energy, my words tumbling out in a desperate, incoherent stream. “She’s my wife! The locks are new! *Six months* is crazy! I was here *yesterday!* Mike, tell them! *Tell them it’s me!*”\n\n“Place your hands behind your back, sir!” The female officer moves fast, her grip firm on my wrist. The cold, hard click of the cuffs is a shock—a sound of absolute, surreal finality that cuts through my panic. I don’t fight, but my body trembles violently.\n\n“You’re under arrest for trespassing and disorderly conduct. You have the right to remain silent…”\n\nThe words blur. I’m guided firmly, my protests dissolving into choked gasps, into the back of the cruiser. Through the cage, I see Mike finally open his front door, talking rapidly to another officer, gesturing at me, his face still etched with pure fear. Neighbors watch from darkened windows.\n\nThe station is a blur of harsh fluorescence and muffled sound. \n\nProcessing passes in a haze. Fingerprints pressed to the cold scanner. The sharp tang of metal in the holding cell where they leave me, just for now. Then the door clanks shut, and silence rushes in. Panic fades, leaving behind a hollow cold that settles deep in my bones, trembling just beneath the skin.\n\nThey called it trespassing. Disorderly conduct.\n\nSaid Emily locked me out.\n\nSaid Mike was terrified.\n\nThe words circle in my head,\n\nFinally, the door opens. A detective enters. He pulls up a chair. \n\n“Mr. Carter,” he begins, voice calm, flat. “Benjamin Carter. That’s the name you gave.” He opens the folder.\n\n“Yes that’s me! Please… Help me. I don’t, I have no idea what going on. Please… I’m begging you.”\n\n“Who are you?”\n\n“Ben Carter,” I repeat.\n\n“Drop the act. Who are you?”\n\n“Please…. Please.”\n\n “Sir, there is no use in lying to me. We ran your prints.”\n\nHe slides a printout toward me. It shows two sets of fingerprints, one clearly labeled from the scanner moments ago. The other…\n\n“These,” he says, tapping the second set, “are the prints on file for Benjamin James Carter. From his driver’s license application, military records… his entire life.”\n\nHe looks at me, gaze steady. \n\n“They don’t match.”\n\n“What?” The denial slips out, weak, automatic. “That’s… impossible. Your machine—”\n\n“The machine is fine,” he says, his voice flat. “Your prints do not match the prints of Benjamin Carter.”\n\nHe slides another paper from the folder. A death certificate. *Benjamin James Carter. Date of Death: March 12th.* Six months ago. My address. My birthdate. My parents’ names. Official. Sealed.\n\n“This is the legal record.”\n\nHe slides over another document, a police report. *Missing Persons. Benjamin Carter. Vehicle recovered from Blackwater River. No sign of driver. Extensive search suspended.* Dated six months ago.\n\nThen a final sheet—a property report.\n\n*Complaint from Emily Carter, \\[Address\\]. Subject reports repeated attempts by unknown male impersonating deceased husband to gain entry to residence. Locks changed on \\[Date – Three Months Ago\\]. Security system installed \\[Date – Last Month\\]. Subject described impersonator as identical to deceased spouse in appearance and voice, causing extreme distress.*\n\nHe closes the folder slowly.\n\n“Your prints don’t match Benjamin Carter’s. Benjamin Carter is legally dead. His widow reports someone matching your exact description has been terrorizing her for months, trying to get into the home you claim is yours.”\n\nHe leans forward slightly, his voice quiet filled with a terrible, chilling certainty.\n\n“So I need you to tell me… *who are you?* And why are you doing this to that poor woman?”\n\nThe detective’s words hang in the air like frozen poison. *Prints don’t match. Legally dead. Terrorizing her.*\n\nThey’re facts, delivered with the crushing weight of bureaucracy. My mind scrambles, a rat in a flooding cage. This isn’t denial anymore—it’s pure, animal panic, clawing at the bars of an impossible trap.\n\n“Who… who am I?” I echo.\n\nThe detective’s pitying stare burns like acid.\n\n“I’m Ben Carter! That’s my house! Emily is my wife*!*” My voice rises, sharper than I mean, echoing off the cinderblock walls. “Can’t you see? She’s locked herself in there, terrified out of her mind, thinking… thinking nonsense! I need to get into that house! She needs me! She needs to *see* me, *properly!* To understand it’s really me!”\n\nI lean forward, the metal chair scraping harshly across the floor.\n\n“Take me there. Right now. Unlock the door. Let me show her. Let me *touch* her. She’ll know. She’ll *know* it’s me then. She has to.”\n\nThe detective doesn’t flinch, but his eyes shift, hardening. That look isn’t suspicion anymore. It’s something colder. More cautious. Like he’s watching a dangerous animal pace inside a cage.\n\n“Mr… whoever you are,” he says evenly. “Emily Carter is safe. She’s under protection. She doesn’t want to see you. She’s terrified of you. Your insistence on forcing your way into her home, after everything we’ve documented, is deeply concerning.”\n\n“Concerning?” A brittle laugh escapes me, high-pitched and wrong. “She’s my wife*!* Of course I need to get to her! Can’t you grasp that? She’s confused! Grieving! But I’m here! I can fix this! Just take me home!”\n\nMy hands clench around the cold metal table, knuckles white. I can feel the rough grain of our front door, the cool brass knob. The need to be inside—to stand in our living room, to smell the faint scent of her vanilla candle—is a physical ache, a compulsion that drowns the chilling weight of the evidence.\n\n“That house… it’s mine. Every brick. She changed the locks, but it’s still mine. I belong there. *She* belongs with *me.* Let me in.”\n\nThe detective slowly pushes his chair back, creating space. His hand settles casually near his hip—near his weapon. \n\nAs I lean further, pleading, my sleeve rides up slightly. My hand brushes against my temple, pushing back a strand of hair damp with nervous sweat. And I feel it.\n\nNot the familiar texture of my own hair. It feels… wrong. Thicker. Coarser. Almost waxy. Like damp straw, not human hair.  *When did I last wash my hair?*\n\nThe question surfaces, absurd amidst the chaos. Yesterday? This morning? \n\nI lift my hand again, intending to run my fingers through it, to confirm the strange sensation.\n\nMy gaze drops to my wrist as I raise my arm. The fluorescent light overhead is harsh, unforgiving. It illuminates the skin of my inner wrist; normally pale and faintly veined.\n\nBut there are no veins.\n\nI stare at the skin, an even, slightly waxy pallor, with no veins beneath the surface, just smooth and unnatural, like porcelain or wax.\n\nMy breath hitches. The frantic energy falters. The desperate urge to scream about Emily, about the house falls silent.\n\nSlowly, I press the index and middle fingers of my other hand against the pulse point on my neck, just below my jaw. A habit ingrained since childhood, checking my own heartbeat in moments of stress.\n\nI press hard. Feel the coolness of my skin.\n\nWait.\n\nNothing.\n\nNo rhythmic thud. No flutter. Just… stillness. Profound, absolute stillness beneath the slightly waxy surface.\n\n*Thump-thump.* I imagine it. *Thump-thump.* But my fingers feel only the unyielding firmness of flesh. No beat. No life.\n\nThe crushing weight of the evidence, the prints, the death certificate, Emily’s terror, Mike’s horror.\n\nNo pulse.\n\nMy hand drops from my neck as if burned. I look down at my other wrist again. \n\n“Sir?” the detective says, cautious now, but the edge of suspicion deepens into something else. Something closer to the fear I saw in Emily’s eyes. “What is it?”\n\nI can’t answer.\n\nThe words *She is my wife* die on my tongue, hollow and meaningless. The desperate urge to *get into that house* curdles into something obscene. Parasitic, as I slowly realize I'm the parasite. \n\nThe house isn’t mine. Emily isn’t mine.\n\nThey belong to Benjamin Carter. The man whose skin I wear. \n\nI look up to the detective, cold resolve blooming in me. \n\nI am Ben Carter. I am going home.\n\nOne way or another. \n\n",
  "num_comments": 7,
  "awards": 0,
  "id": "1lws80u",
  "word_count": 2388
}