{
  "title": "My neighbour was a legit witch, with a cat",
  "author": "1000andonenites",
  "score": 94,
  "upvote_ratio": 0.99,
  "created_utc": 1751806344.0,
  "created_date": "2025-07-06 18:22:24",
  "url": "https://reddit.com/r/scarystories/comments/1lt0hno/my_neighbour_was_a_legit_witch_with_a_cat/",
  "text": "Pauline. Her name was Pauline, and the cat was called Jake. I miss them both- Pauline was super-friendly, and Jake was kinda funny, being so possessive and careful with her. A big black pissed-off-looking cat.\n\nShe didn’t always used to be a witch. She was I think a retired nurse, or something in a hospital. Later I heard it said she wasn’t a nurse at all, just the housekeeper and laundry-lady. Whatever. People can be so mean.\n\nAnyway. She had never married, just lived by herself in a house with garden she kept wild, Jake coming and going as he pleased, kinda taking care of her.\n\nBecause there were always people visiting her.\n\nI think at first she tried to keep herself to herself, and to Jake, as it should be, but people wouldn’t leave her alone. Always coming to her door to talk about their sicknesses and illnesses. Pauline would talk to them over a cup of tea and help figure it out. The person would leave and soon feel better. And not just illnesses. I know Jenna who I knew from school visited her after her husband beat her up and there were police at their door. Folk said Pauline helped Jenna and her kid disappear. And when my cousin called me a few months ago crying, I just heard myself telling her to visit Pauline. I didn’t hear from my cousin for a long while after that- she left her husband.\n\nClinics were shutting down. Services were few, and then fewer. Visiting a doctor was a luxury, even for those who could pay. It was not surprising Pauline was getting more visitors than ever, people who just needed to talk, to show her the rash on their kid’s back, the lump behind their ear, the swelling by their eye, the itchy cough that just wouldn’t go away. Pauline loved chatting, and had time for everybody.  Sometimes she told folk they just had to try see a doctor.\n\nNow, pretending to garden, I looked over my fence  and saw a woman with a baby enter. I knew her family- they weren’t good people. A faint wail from the baby drifted over the fence, and I heard the ominous death rattle at the end of the cry. I shook my head. Pauline’s ways must be getting to me. I tried to concentrate on my weeds.\n\nThe mom and her baby came back out into the garden. The mom was crying too, silent tears pouring down her face.\n\nPauline should have known better. Meddle meddle meddle. Now she was talking.  \n\nThen I heard the mother’s reply “Pauline- I can’t. The wait times, plus the travel time, and I just don’t have the money- no, I already took out - no-” The baby wailed, and Jake glared at them. The mother left, and Jake slunk after her.  \n\nIt was darkening. I couldn’t sleep. I had heard the baby had died an hour or so earlier, and even though I didn’t know the family, the news was upsetting. I stood by my window, looking at Pauline’s house, the dark overgrown garden. Why didn’t she try harder to help the baby? Was she even a nurse?\n\nLit up by the street lights, I saw a streak of black running towards Pauline’s house. Jake was returning. Why was he so agitated? He slipped inside.\n\nLess than sixty seconds later Pauline appeared at the door. I watched them jump into her old car, and drive off. Was there an emergency?\n\nAnd then I saw them. A swell of angry men pouring into the street Paulin had just fled. I could hear them, growling and angry. I recognized some- uncles- cousins of the baby who had just died. They all gathered outside Pauline’s house, yelling.\n\nAnd then first Molotov cocktail smashed into her window, followed by the second, and third. The crowd thickened, the flames leapt high. The house was burning.\n\nAnd I never saw Pauline and Jake again.  \n\n ",
  "num_comments": 23,
  "awards": 0,
  "id": "1lt0hno",
  "word_count": 663
}