{
  "title": "I'm a serial killer. I met something scarier.",
  "author": "funwithmydemons",
  "score": 341,
  "upvote_ratio": 0.99,
  "created_utc": 1751011272.0,
  "created_date": "2025-06-27 01:01:12",
  "url": "https://reddit.com/r/scarystories/comments/1lloanq/im_a_serial_killer_i_met_something_scarier/",
  "text": "It was 3:17am at the Waffle House. I wiped my mouth with my sleeve and pushed the table away from my fat belly, the metal chair scraping the greasy floor. \n\nI had time to kill until the next job, so I headed out to the parking lot to make my way to the nearest motel. I hadn't come through this town yet, so no one should recognize me there, I figured.\n\nStumbling with my bum leg past the dumpsters, I about had a damn heart attack when the lid slammed. \n\nI shook my head and kept going.\n\nAnother slam.\n\nRage boiled over me. I stopped to glare back at the dumpsters, waiting to see which methed out employee had been responsible. \n\nThe wood doors around the dumpsters creaked in the night wind, closing themselves slowly.\n\nAnother slam and the door popped open. Looking like he'd kicked it open with his foot, the employee strolled out carelessly. Whistling a jolly little tune, even.\n\nI rolled my shoulders and huffed. This fucker was about to learn some respect. I cracked my knuckles and headed back towards him. \n\n\"Hey!\" I shouted. \n\nHe stopped, startled. I closed the distance and grabbed a fistful of his greasy black apron. He was mid-forties maybe, but looked eighty - he had the classic sunken eyes and leathery skin of hard living or drugs. He just stood there, mouth agape, like the stupid animal he was. I wanted to knock out his nasty black teeth.\n\n\"Do you have *any* idea--\"\n\n\"Hey, you there!\" Another voice interrupted me.\n\nThe other man leaned against the building by the door, one hand in his pocket and the other smoking a cigarette. I must've been too angry to have noticed him before.\n\n\"I've been looking for a truck driver,\" he said.\n\nMy grip on the employee tightened in rage. He was shaking now. \n\n\"'Scuse me?\" I yelled back.\n\n\"I could use a ride,\" the man said calmly, \"If you'd be so kind.\"\n\nGetting a better look at him, I was more confused. He wasn't an employee, he didn't have the stupid black apron. He wore dusty boots, raggedy jeans and a gray zip-up jacket, but his face was what interested me. Young, bright eyes, pale and smooth skin, *blonde*. Like a halo around his head. \n\nMy anger was replaced by something else. Something darker. \n\nI threw the employee to the ground. \"Get lost,\" I told him. He scrambled away, where to I didn't care to look. My focus was on someone else now.\n\nI made my way to the other man, wary but interested.\n\n\"You ain't got fuckin' family to help you?\" I asked.\n\nHe was pretty. *Too* pretty. Like one of those weird celebrities with too-perfect faces. I couldn't look away.\n\nSurely someone would miss him if something happened to him.\n\n\"Nope,\" he answered, stomping out his cigarette, \"there's no one to care.\"\n\nHe picked up the cigarette butt and flicked it into the can beside him. Like he didn't want to litter, like that one cigarette would really make a difference. \n\n\"'Cept you, maybe,\" he said with a smile and a wink, \"maybe I can convince you to care.\"\n\nSomething about him felt charming. Playful. A little ray of life in this hellhole. \n\nHe didn't belong here.\n\nOf course, neither did the *others* I'd picked up.\n\nI just had one question. \n\n\"How old are you?\" I asked.\n\nThose blue eyes looked me up and down, studying me. Not in a nervous manner, but something else. It made me a little uncomfortable but not enough for me to care.\n\n\"Nineteen,\" he said after a pause. \n\nThe darkness stirred again.\n\nThis was too good to be true. \n\n\"I've got a little cash on me,\" he said, \"I'm sure we could work something out.\"\n\nI had already decided the minute I saw him.\n\n\"Fine,\" I told him, \"Hurry up.\"\n\nHe smiled, a little too wide. \n\n\"You're too kind,\" he said.\n\nI scoffed, \"Yeah, bud, I'm a real saint.\"\n\n-\n\n\"So, where ya headed?\" I asked as we settled into the cab.\n\n\"Anywhere's better than here,\" he said.\n\nI stifled a smile. It was funny when they said things they'd regret.\n\n\"You really got no one out here? Not family, not a girlfriend, nothin'?\"\n\nHe paused to think. Then leaned a little closer, a wry, shit-eating grin on that perfect face. \n\n\"You really think I'd be in your truck if I did?\"\n\nI chuckled openly at that one, \"Yeah, okay, you got me there.\"\n\n\"Well, it's gonna be a while 'til the next stop,\" I warned him.\n\n\"Perfect\" he said, settling into his seat, \"Maybe I *will* have a friend by the end of this.\"\n\nI rolled my eyes, \"Yeah, whatever,\" I said.\n\nHis weird sense of humor was a nice change of pace, I thought. This ride might actually be enjoyable.\n\nI usually didn't enjoy their company until they were hogtied in the back.\n\n-\n\n*\"Last gas 103 miles\"*, the sign read. \n\nAnother hour and we'd be at the spot I'd picked out. \n\n*\"You ever get scared out here?\"*\n\nHis voice startled me. It sounded different, distorted almost. I chalked it up to the altitude fucking with my ears. \n\nIt was the first thing he had said in maybe thirty, forty minutes, I had actually thought he was sleeping. He had been awfully quiet ever since we'd gotten off the main roads. \n\n\"I ain't scared of nothin', kid,\" I told him. \n\n\"C'mon, everybody gets scared,\" He pushed on, leaning closer to me like he had a secret, \"Sometimes it's even fun to be scared.\"\n\nNow *that* was funny.\n\nI'd have to tease him about that later.\n\n\"Why the hell would I be scared out here?\"\n\n\"Well, for starters,\" he said, \"there's no one else around. No one to see you, no one to hear you, no one to help you...\"\n\nI was chuckling now too, shaking my head. That was kind of the point of this, kid.\n\n\"Nothing but the pines and the fog off the creek,\" he continued.\n\n\"Well, the fog *is* annoying, I'll give you that,\" I said, \"I can't tell you how many times a fucking deer just pops out and smears itself all over the windshield.\"\n\nEven then, the fog was so thick I couldn't see but maybe a single car length in front of us. The truck lights only made it worse. I powered through up the hills like I always did. There were never any other vehicles on that road. \n\n\"Ah, the poor deer,\" he said. \"They used to have more natural predators out here. But they were all driven off a long, long time ago.\"\n\nSomething was off about him. Different. I couldn't quite put my finger on it, but the warm and sunny act he'd put on earlier was gone. He felt cold now, distant, a little creepy even.\n\nIt didn't matter. We were almost there.\n\nWe sat in silence for another little while. I kept my eyes to the fog swirling in the headlights, he kept his eyes locked on me. Staring, without a word, like I'd vanish if he even fucking blinked.\n\nHell, maybe *he* was getting scared now. \n\nHe had every right to, after all. \n\nThe air in the cab got colder. It was supposed to be a warm night, I thought. Condensation built up on the window from the sudden change. I flipped the wipers on, sighing as they made that god-awful, nails-on-a-chalkboard screech with every swipe. \n\nThe biggest spider I've ever seen in my life crawled out of the air vent.\n\n\"Holy shit!\"\n\nIt was the size of my fucking fist, hairy and dark with yellow stripes on its legs.\n\nI'm a proud man, not afraid of much. But I don't fuck around with goddamn tarantulas. I nearly lost control of the truck trying to whack it back to whatever hell it came from.\n\nSilently, without even so much as a flinch, the other man placed his pale, smooth hand atop the dash. Palm up, like an offering. My mouth hung open as the spider went into his palm, and just as quickly, into his zip-up jacket.\n\nI almost couldn't speak.\n\n\"What the FUCK was that, man!?\" I stammered, \"I swear to god if that's your FUCKING PET--\"\n\n\"It's not,\" he said calmly, \"unless it wants to be.\"\n\nI was gonna explode. Surely, I would stroke-out any minute.\n\n\"And it looks to be a Tiger Wolf Spider, but I'm not an entomologist.\"\n\n\"Take that thing out of your pocket, NOW,\" I demanded.\n\nHe took out the spider calmly, like it was a pack of smokes, like any of this was *normal.*\n\nLooking at it the second time was almost worse. I squinted my eyes and looked away to the road.\n\n\"Kill that fucking thing!\" \n\n*\"You'd like that, wouldn't you?\"*\n\nThe voice wasn't his.\n\nIt waa a woman's. *Hers.* From last week.\n\nI glanced over. \n\nShe was in the passenger seat again. Tiny, frail like a bird, a little button-nose and blue eyes. Yellow-blonde hair. The skin on half her face was gone to gorey bone, including a hollow eye-socket. The spider climbed into it.\n\n\"What the FUCK--\"\n\nI slammed on the brakes.\n\nThe truck skid to a stop as I caught my breath. I  looked around, frantically. The young man looked groggy, bewildered. He rubbed his eyes and ran his hands through his hair.\n\n\"How long was I out?\" He asked.\n\n\"W-what do-- what the *FUCK* are you talking about!?\"\n\nMy heart thumped in my ears, my throat was dry and my body soaked in sweat. I was shaking. The man was calm, half-asleep, looking at me like I had two heads.\n\nHe reached in his pocket and pulled out a pack of smokes. No spider.\n\n\"You wanna take a break?\" He asked me, concern in his soft voice.\n\nThis didn't make sense.\n\n\"Where's the goddamn spider?\" I demanded.\n\nHe jolted upright, looking in his seat and around the cab. \"There's a spider in here? Where?\"\n\nI ran my clammy hands over my face, rubbing my eyes.\n\nI looked around the cab. Everything looked...normal. The young man just blinked at me, like an innocent little doe in headlights, hand still outstretched with the pack of smokes.\n\nI ripped the pack from his hands. \n\n\"We're taking a break,\" I said. \n\n\"Cool,\" he said, disinterested. He started to follow me out of the truck.\n\n\"No, you wait inside,\" I snapped. \n\n\"Alrighty,\" he chimed back.\n\nI stepped out into the humid, foggy air. The temperature shocked me - it had been so much colder in the cab. I must've turned the damn AC on and not known it. \n\nThis wasn't the spot I usually took them to, but it was close enough. Far away enough where no, no one could see or hear anything, just like that stupid kid said. It would do just fine, and I could just drive his body out farther to where I usually dumped them. But after that weird...dream, I wasn't sure I *wanted* to go where the other ones were. Maybe I would just carve out a new spot here, I thought. \n\nI was around the back mixing up two special cups of joe when I heard the passenger door open and close. I went back around quickly.\n\n\"Goddammit I *said* stay in the--\"\n\nNo one was there. The truck lights flickered and a cold chill shook my body. I peered through the fog but there was nothing.\n\nMaybe I *was* going a little crazy.\n\nMaybe I was just tired. \n\nI took the mugs back to the inside of the cab and carefully handed the correct one to the man beside me.\n\n\"Coffee?\" I asked.\n\n\"I'm not a coffee person,\" he said politely.\n\n\"Everyone says that until they have *my* coffee,\" I winked.\n\nHe laughed and shook his head. \"You're terrible,\" he said, grinning wide with those perfect teeth.\n\nI watched him absolutely gulp his coffee down like a sick, dying camel. \n\nConfused, I took a small sip of mine. It nearly burned my lip clean off.\n\nWeird. But at least it wouldn't take as long to work, I figured. \n\n\"So, what's your story?\" I asked him, realizing I never played the get-to-know-you game that I usually slog through with my passengers. \n\n\"Oh, I'm just an old soul passing through,\" he said. \"My story's a long one. I don't think we'd have the time to cover it if we tried.\"\n\n\"See, that. You're so young but you talk like an old fuckin' man,\" I chuckled, \"I mean, where do you get that? Where are you from?\"\n\n\"Well, my ex girlfriend thought I was from the depths of hell,\" he sat his mug down, completely finished with it, \"but I assured her I'm Catholic.\"\n\nI laughed at his joke, a little too loud. I sipped my coffee. \"Women, eh?\"\n\n\"I thought she was an angel. I still do,\" he said, \"but now... I doubt she could even walk into church  without bursting into flames.\"\n\nI slapped my knee, doubling over. I couldn't remember the last time I laughed so hard. My cheeks were warm. \n\n\"You're too young to be having f-fuckin' women problems,\" I told him.\n\n\"Hmm,\" he murmured. \"But just the right age to die.\"\n\nI blinked. \"Huh?\"\n\n\"That's the perfect age, isn't it?\" he said, \"Eighteen to twenty-one? Blonde hair, blue eyes, no one to miss them?\"\n\nI stammered. My thoughts were... clunky. I hadn't realized how dizzy I was getting.\n\nNo.\n\n*No.*\n\nThat wasn't possible. I made the coffee myself, I gave him the coffee myself, he downed it in seconds! \n\nThe cab was freezing cold again. \n\nMy head spun, my thoughts racing. The air was humid, my mouth so dry it felt glued together. \n\nI was spacing out. Losing time.\n\nSuddenly, I was in the back of the truck on the cot, where *he* was supposed to be.\n\nThe fog rolled in with me. Against it he stood, at the edge of the open truck, a dark shape in the night.\n\n\"You know, Father Romano says I shouldn't harm 'anything with a soul'\", he said. The distortion was back in his voice, like an old corrupted mix tape. He was holding rope in his hand. \n\n\"And to tell you the truth,\" he continued, \"I've always had a soft spot for animals, so I've never liked hurting them.\"\n\nIn a blink, he was next to me. Tying off my arm. Like a tourniquet. \n\n\"But you don't *have* a soul, do you?\" \n\nHe was in my face, inches away, so close he blurred.\n\n\"And you're *worse* than an animal because YOU. KNOW. BETTER!\"\n\nTears rolled down my face, the sheer thunder of his voice shaking me to my core. It was unnatural. *Ungodly.*\n\n\"Why did you do it?\" His voice was soft, calm, as harmless as it had been before. \"Why did you kill all those poor little girls and boys? And to leave their bodies like that, dumped so... unceremoniously in my backyard.\" \n\nHe shook his head at me, frowning, \"At least I kill for a reason.\"\n\nHis limbs began...snapping. Loud pops as they twisted, contorted, grew taller and longer. A black shadow overtook his body, erasing all trace of his humanity in a blink, like he had never had skin or clothes or even a face to begin with. There was nothing. Only a dark shape remained, made of long twisted muscle and bone, shaped like some bastardized version of a man with horns. \n\nThen, a smile appeared. That wide smile, so perfect and *sharp*. \n\nI couldn't scream. I couldn't move. \n\nI tried to stay awake but I was fading fast.\n\nThe figure launched towards me on all fours, moving like a spider on its freaky limbs. It was over top of me in seconds.\n\n\"God, I'm *SO HUNGRY!*\" \n\nHis face was almost pressed against mine, bared teeth dripping saliva onto my nose and mouth. I felt nothing.\n\nHe rose back up in a blink, standing upright, legs bending to fit in the trailer. He wiped his mouth carefully and ran a clawed hand through the silhouette of his once-beautiful hair, right between his horns. He sighed.\n\n\"But I have to be patient,\" he said softly, \"You need to last... a while. I suppose I'll pick you apart, piece by piece, rationing your disgusting body...\"\n\nHis face was in front of mine again, grinning.\n\n\"And then when I'm done making you useful, I'm not going to kill you - oh no, that's too easy for you...\"\n\nEverything was fading fast, patches of black closing in on me.\n\nHe grabbed my face with a clawed hand, pulling me close to make sure I heard every word.\n\n\"I'm going to dump your limbless body with all the people you've killed, way out here in the pines. You can use your *fucking teeth* to dig your way out of the mud, choking on it like you deserve.\"\n\nHe dropped my face, my head slamming back down.\n\nEverything went dark. \n\nI prayed I wouldn't wake up again. Not to this. \n\nBut my prayers never meant much, and I knew from my sins that the drugs were only temporary.",
  "num_comments": 74,
  "awards": 0,
  "id": "1lloanq"
}